zephyrproject-rtos/zephyr/include/drivers/clock_control/gd32_clock_control.h
/*
 * Copyright (c) 2021 Tokita, Hiroshi <toita.hiroshi@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DRIVERS_CLOCK_CONTROL_GD32_CLOCK_CONTROL_H_
#define ZEPHYR_INCLUDE_DRIVERS_CLOCK_CONTROL_GD32_CLOCK_CONTROL_H_

#include <drivers/clock_control.h>
#include <dt-bindings/clock/gd32_clock.h>

struct gd32_pclken {
	uint32_t bus;
	uint32_t enr;
};

/* register offset */
/* peripherals enable */
#define GD32_AHBEN_REG_OFFSET                0x14U                      /*!< AHB enable register offset */
#define GD32_APB1EN_REG_OFFSET               0x1CU                      /*!< APB1 enable register offset */
#define GD32_APB2EN_REG_OFFSET               0x18U                      /*!< APB2 enable register offset */

/* peripherals reset */
#define GD32_AHBRST_REG_OFFSET               0x28U                      /*!< AHB reset register offset */
#define GD32_APB1RST_REG_OFFSET              0x10U                      /*!< APB1 reset register offset */
#define GD32_APB2RST_REG_OFFSET              0x0CU                      /*!< APB2 reset register offset */
#define GD32_RSTSCK_REG_OFFSET               0x24U                      /*!< reset source/clock register offset */

/* clock control */
#define GD32_CTL_REG_OFFSET                  0x00U                      /*!< control register offset */
#define GD32_BDCTL_REG_OFFSET                0x20U                      /*!< backup domain control register offset */

/* clock stabilization and stuck interrupt */
#define GD32_INT_REG_OFFSET                  0x08U                     /*!< clock interrupt register offset */

/* configuration register */
#define GD32_CFG0_REG_OFFSET                 0x04U                      /*!< clock configuration register 0 offset */
#define GD32_CFG1_REG_OFFSET                 0x2CU                      /*!< clock configuration register 1 offset */

#define GD32_PCLK_EN_OFFSET_DMA0 GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_DMA1 GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_SRAM GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_FMC GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_CRC GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_EXMC GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_USBFS GD32_AHBEN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER1 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER2 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER3 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER4 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER5 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER6 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_WWDGT GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_SPI1 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_SPI2 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_USART1 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_USART2 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_UART3 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_UART4 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_I2C0 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_I2C1 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_CAN0 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_CAN1 GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_BKPI GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_PMU GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_DAC GD32_APB1EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_RTC GD32_BDCTL_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_AF GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_GPIOA GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_GPIOB GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_GPIOC GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_GPIOD GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_GPIOE GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_ADC0 GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_ADC1 GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_TIMER0 GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_SPI0 GD32_APB2EN_REG_OFFSET
#define GD32_PCLK_EN_OFFSET_USART0 GD32_APB2EN_REG_OFFSET

#define GD32_PCLK_RST_OFFSET_DMA0 GD32_AHBRST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_DMA1 GD32_AHBRST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_CRC GD32_AHBRST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_EXMC GD32_AHBRST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_USBFS GD32_AHBRST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER1 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER2 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER3 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER4 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER5 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER6 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_WWDGT GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_SPI1 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_SPI2 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_USART1 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_USART2 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_UART3 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_UART4 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_I2C0 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_I2C1 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_CAN0 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_CAN1 GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_BKPI GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_PMU GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_DAC GD32_APB1RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_RTC GD32_BDCTL_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_AF GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_GPIOA GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_GPIOB GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_GPIOC GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_GPIOD GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_GPIOE GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_ADC0 GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_ADC1 GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_TIMER0 GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_SPI0 GD32_APB2RST_REG_OFFSET
#define GD32_PCLK_RST_OFFSET_USART0 GD32_APB2RST_REG_OFFSET


#define GD32_PCLK_BITS_DMA0 0U
#define GD32_PCLK_BITS_DMA1 1U
#define GD32_PCLK_BITS_SRAM 2U
#define GD32_PCLK_BITS_FMC 4U
#define GD32_PCLK_BITS_CRC 6U
#define GD32_PCLK_BITS_EXMC 8U
#define GD32_PCLK_BITS_USBFS 12U
#define GD32_PCLK_BITS_TIMER1 0U
#define GD32_PCLK_BITS_TIMER2 1U
#define GD32_PCLK_BITS_TIMER3 2U
#define GD32_PCLK_BITS_TIMER4 3U
#define GD32_PCLK_BITS_TIMER5 4U
#define GD32_PCLK_BITS_TIMER6 5U
#define GD32_PCLK_BITS_WWDGT 11U
#define GD32_PCLK_BITS_SPI1 14U
#define GD32_PCLK_BITS_SPI2 15U
#define GD32_PCLK_BITS_USART1 17U
#define GD32_PCLK_BITS_USART2 18U
#define GD32_PCLK_BITS_UART3 19U
#define GD32_PCLK_BITS_UART4 20U
#define GD32_PCLK_BITS_I2C0 21U
#define GD32_PCLK_BITS_I2C1 22U
#define GD32_PCLK_BITS_CAN0 25U
#define GD32_PCLK_BITS_CAN1 26U
#define GD32_PCLK_BITS_BKPI 27U
#define GD32_PCLK_BITS_PMU 28U
#define GD32_PCLK_BITS_DAC 29U
#define GD32_PCLK_BITS_RTC 15U
#define GD32_PCLK_BITS_AF 0U
#define GD32_PCLK_BITS_GPIOA 2U
#define GD32_PCLK_BITS_GPIOB 3U
#define GD32_PCLK_BITS_GPIOC 4U
#define GD32_PCLK_BITS_GPIOD 5U
#define GD32_PCLK_BITS_GPIOE 6U
#define GD32_PCLK_BITS_ADC0 9U
#define GD32_PCLK_BITS_ADC1 10U
#define GD32_PCLK_BITS_TIMER0 11U
#define GD32_PCLK_BITS_SPI0 12U
#define GD32_PCLK_BITS_USART0 14U

#define GD32_PCLK_EN_INIT(x) { .bus = GD32_PCLK_EN_OFFSET_##x, .enr = GD32_PCLK_BITS_##x }
#define GD32_PCLK_RST_INIT(x) { .bus = GD32_PCLK_RST_OFFSET_##x, .enr = GD32_PCLK_BITS_##x }

/* AHB peripherals */
static const struct gd32_pclken GD32_PCLK_EN_DMA0 = GD32_PCLK_EN_INIT(DMA0);
static const struct gd32_pclken GD32_PCLK_EN_DMA1 = GD32_PCLK_EN_INIT(DMA1);
static const struct gd32_pclken GD32_PCLK_EN_CRC = GD32_PCLK_EN_INIT(CRC);
static const struct gd32_pclken GD32_PCLK_EN_EXMC = GD32_PCLK_EN_INIT(EXMC);
static const struct gd32_pclken GD32_PCLK_EN_USBFS = GD32_PCLK_EN_INIT(USBFS);
/* APB1 peripherals */
static const struct gd32_pclken GD32_PCLK_EN_TIMER1 = GD32_PCLK_EN_INIT(TIMER1);
static const struct gd32_pclken GD32_PCLK_EN_TIMER2 = GD32_PCLK_EN_INIT(TIMER2);
static const struct gd32_pclken GD32_PCLK_EN_TIMER3 = GD32_PCLK_EN_INIT(TIMER3);
static const struct gd32_pclken GD32_PCLK_EN_TIMER4 = GD32_PCLK_EN_INIT(TIMER4);
static const struct gd32_pclken GD32_PCLK_EN_TIMER5 = GD32_PCLK_EN_INIT(TIMER5);
static const struct gd32_pclken GD32_PCLK_EN_TIMER6 = GD32_PCLK_EN_INIT(TIMER6);
static const struct gd32_pclken GD32_PCLK_EN_WWDGT = GD32_PCLK_EN_INIT(WWDGT);
static const struct gd32_pclken GD32_PCLK_EN_SPI1 = GD32_PCLK_EN_INIT(SPI1);
static const struct gd32_pclken GD32_PCLK_EN_SPI2 = GD32_PCLK_EN_INIT(SPI2);
static const struct gd32_pclken GD32_PCLK_EN_USART1 = GD32_PCLK_EN_INIT(USART1);
static const struct gd32_pclken GD32_PCLK_EN_USART2 = GD32_PCLK_EN_INIT(USART2);
static const struct gd32_pclken GD32_PCLK_EN_UART3 = GD32_PCLK_EN_INIT(UART3);
static const struct gd32_pclken GD32_PCLK_EN_UART4 = GD32_PCLK_EN_INIT(UART4);
static const struct gd32_pclken GD32_PCLK_EN_I2C0 = GD32_PCLK_EN_INIT(I2C0);
static const struct gd32_pclken GD32_PCLK_EN_I2C1 = GD32_PCLK_EN_INIT(I2C1);
static const struct gd32_pclken GD32_PCLK_EN_CAN0 = GD32_PCLK_EN_INIT(CAN0);
static const struct gd32_pclken GD32_PCLK_EN_CAN1 = GD32_PCLK_EN_INIT(CAN1);
static const struct gd32_pclken GD32_PCLK_EN_BKPI = GD32_PCLK_EN_INIT(BKPI);
static const struct gd32_pclken GD32_PCLK_EN_PMU = GD32_PCLK_EN_INIT(PMU);
static const struct gd32_pclken GD32_PCLK_EN_DAC = GD32_PCLK_EN_INIT(DAC);
static const struct gd32_pclken GD32_PCLK_EN_RTC = GD32_PCLK_EN_INIT(RTC);
/* APB2 peripherals */
static const struct gd32_pclken GD32_PCLK_EN_AF = GD32_PCLK_EN_INIT(AF);
static const struct gd32_pclken GD32_PCLK_EN_GPIOA = GD32_PCLK_EN_INIT(GPIOA);
static const struct gd32_pclken GD32_PCLK_EN_GPIOB = GD32_PCLK_EN_INIT(GPIOB);
static const struct gd32_pclken GD32_PCLK_EN_GPIOC = GD32_PCLK_EN_INIT(GPIOC);
static const struct gd32_pclken GD32_PCLK_EN_GPIOD = GD32_PCLK_EN_INIT(GPIOD);
static const struct gd32_pclken GD32_PCLK_EN_GPIOE = GD32_PCLK_EN_INIT(GPIOE);
static const struct gd32_pclken GD32_PCLK_EN_ADC0 = GD32_PCLK_EN_INIT(ADC0);
static const struct gd32_pclken GD32_PCLK_EN_ADC1 = GD32_PCLK_EN_INIT(ADC1);
static const struct gd32_pclken GD32_PCLK_EN_TIMER0 = GD32_PCLK_EN_INIT(TIMER0);
static const struct gd32_pclken GD32_PCLK_EN_SPI0 = GD32_PCLK_EN_INIT(SPI0);
static const struct gd32_pclken GD32_PCLK_EN_USART0 = GD32_PCLK_EN_INIT(USART0);

static const struct gd32_pclken GD32_PCLK_SLP_SRAM = GD32_PCLK_EN_INIT(SRAM);
static const struct gd32_pclken GD32_PCLK_SLP_FMC = GD32_PCLK_EN_INIT(FMC);

/* AHB peripherals */
static const struct gd32_pclken GD32_PCLK_RST_USBFS = GD32_PCLK_RST_INIT(USBFS);
/* APB1 peripherals */
static const struct gd32_pclken GD32_PCLK_RST_TIMER1 = GD32_PCLK_RST_INIT(TIMER1);
static const struct gd32_pclken GD32_PCLK_RST_TIMER2 = GD32_PCLK_RST_INIT(TIMER2);
static const struct gd32_pclken GD32_PCLK_RST_TIMER3 = GD32_PCLK_RST_INIT(TIMER3);
static const struct gd32_pclken GD32_PCLK_RST_TIMER4 = GD32_PCLK_RST_INIT(TIMER4);
static const struct gd32_pclken GD32_PCLK_RST_TIMER5 = GD32_PCLK_RST_INIT(TIMER5);
static const struct gd32_pclken GD32_PCLK_RST_TIMER6 = GD32_PCLK_RST_INIT(TIMER6);
static const struct gd32_pclken GD32_PCLK_RST_WWDGT = GD32_PCLK_RST_INIT(WWDGT);
static const struct gd32_pclken GD32_PCLK_RST_SPI1 = GD32_PCLK_RST_INIT(SPI1);
static const struct gd32_pclken GD32_PCLK_RST_SPI2 = GD32_PCLK_RST_INIT(SPI2);
static const struct gd32_pclken GD32_PCLK_RST_USART1 = GD32_PCLK_RST_INIT(USART1);
static const struct gd32_pclken GD32_PCLK_RST_USART2 = GD32_PCLK_RST_INIT(USART2);
static const struct gd32_pclken GD32_PCLK_RST_UART3 = GD32_PCLK_RST_INIT(UART3);
static const struct gd32_pclken GD32_PCLK_RST_UART4 = GD32_PCLK_RST_INIT(UART4);
static const struct gd32_pclken GD32_PCLK_RST_I2C0 = GD32_PCLK_RST_INIT(I2C0);
static const struct gd32_pclken GD32_PCLK_RST_I2C1 = GD32_PCLK_RST_INIT(I2C1);
static const struct gd32_pclken GD32_PCLK_RST_CAN0 = GD32_PCLK_RST_INIT(CAN0);
static const struct gd32_pclken GD32_PCLK_RST_CAN1 = GD32_PCLK_RST_INIT(CAN1);
static const struct gd32_pclken GD32_PCLK_RST_BKPI = GD32_PCLK_RST_INIT(BKPI);
static const struct gd32_pclken GD32_PCLK_RST_PMU = GD32_PCLK_RST_INIT(PMU);
static const struct gd32_pclken GD32_PCLK_RST_DAC = GD32_PCLK_RST_INIT(DAC);
/* APB2 peripherals */
static const struct gd32_pclken GD32_PCLK_RST_AF = GD32_PCLK_RST_INIT(AF);
static const struct gd32_pclken GD32_PCLK_RST_GPIOA = GD32_PCLK_RST_INIT(GPIOA);
static const struct gd32_pclken GD32_PCLK_RST_GPIOB = GD32_PCLK_RST_INIT(GPIOB);
static const struct gd32_pclken GD32_PCLK_RST_GPIOC = GD32_PCLK_RST_INIT(GPIOC);
static const struct gd32_pclken GD32_PCLK_RST_GPIOD = GD32_PCLK_RST_INIT(GPIOD);
static const struct gd32_pclken GD32_PCLK_RST_GPIOE = GD32_PCLK_RST_INIT(GPIOE);
static const struct gd32_pclken GD32_PCLK_RST_ADC0 = GD32_PCLK_RST_INIT(ADC0);
static const struct gd32_pclken GD32_PCLK_RST_ADC1 = GD32_PCLK_RST_INIT(ADC1);
static const struct gd32_pclken GD32_PCLK_RST_TIMER0 = GD32_PCLK_RST_INIT(TIMER0);
static const struct gd32_pclken GD32_PCLK_RST_SPI0 = GD32_PCLK_RST_INIT(SPI0);
static const struct gd32_pclken GD32_PCLK_RST_USART0 = GD32_PCLK_RST_INIT(USART0);



#endif // GD32_CLOCK_CONTROL_H
